static/projects/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-19 Thu 01:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Matthew Carter's &lt;m@ahungry.com&gt; Projects and Tinkerings</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Matthew Carter" />


</head>
<body>
<div id="content">
<h1 class="title">Matthew Carter's &lt;m@ahungry.com&gt; Projects and Tinkerings</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgca7e5c2">Preamble</a></li>
<li><a href="#org063c5c8">Websites</a>
<ul>
<li><a href="#org750345e">Ahungry Dot Com&#xa0;&#xa0;&#xa0;<span class="tag"><span class="commonlisp">commonlisp</span></span></a></li>
<li><a href="#org5ac97d2">Sluglisp / Slugelisp / Slugclojure&#xa0;&#xa0;&#xa0;<span class="tag"><span class="commonlisp">commonlisp</span></span></a></li>
<li><a href="#org0e9a355">Langpop&#xa0;&#xa0;&#xa0;<span class="tag"><span class="commonlisp">commonlisp</span></span></a></li>
</ul>
</li>
<li><a href="#org7380f71">Games</a>
<ul>
<li><a href="#org0581d6b">Magic Shield Attack&#xa0;&#xa0;&#xa0;<span class="tag"><span class="clojure">clojure</span>&#xa0;<span class="godot">godot</span></span></a></li>
<li><a href="#org6ae1891">Pseudo&#xa0;&#xa0;&#xa0;<span class="tag"><span class="javascript">javascript</span>&#xa0;<span class="commonlisp">commonlisp</span></span></a></li>
<li><a href="#orgae7bcb6">Ahungry Tactics&#xa0;&#xa0;&#xa0;<span class="tag"><span class="javascript">javascript</span></span></a></li>
</ul>
</li>
<li><a href="#org156749d">Emacs Lisp Packages&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></a>
<ul>
<li><a href="#org847673c">Color Theme Ahungry&#xa0;&#xa0;&#xa0;<span class="tag"><span class="themes">themes</span>&#xa0;<span class="elisp">elisp</span></span></a></li>
<li><a href="#org668403c">Org Jira&#xa0;&#xa0;&#xa0;<span class="tag"><span class="jira">jira</span>&#xa0;<span class="elisp">elisp</span></span></a></li>
<li><a href="#orga8f69c1">md4rd (mode for reddit, aka reddit-mode)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="elisp">elisp</span>&#xa0;<span class="reddit">reddit</span></span></a></li>
</ul>
</li>
<li><a href="#org5d48720">Conclusion</a></li>
<li><a href="#org3fd9751">Comments</a></li>
</ul>
</div>
</div>
<p>
<b>HINT</b>: You can press 'n' and 'p' keys to navigate around quickly and
read this as if it were a chapter book.  Alternatively, click in the
top right corner to see it as a giant HTML document with folding, or
just disable javascript if you'd prefer to see it as a massive in-line
file.
</p>

<p>
<b>BONUS HINT</b>: If you want to read about some particular subject, press
'C' for a tags index (I tend to tag by programming language, or
'thing').  You can use '?' to see more shortcuts, or click any HELP
button.
</p>

<p>
Back to main site: <a href="http://ahungry.com">http://ahungry.com</a>
</p>

<div id="outline-container-orgca7e5c2" class="outline-2">
<h2 id="orgca7e5c2">Preamble</h2>
<div class="outline-text-2" id="text-orgca7e5c2">
<p>
Within this page, you will find some of the various projects that I've
been working on / have worked on etc. with some thoughts and musings
on each.
</p>
</div>
</div>

<div id="outline-container-org063c5c8" class="outline-2">
<h2 id="org063c5c8">Websites</h2>
<div class="outline-text-2" id="text-org063c5c8">
<p>
Making websites is essentially where I began my programming career
(more or less), so it's where I'll begin this list.
</p>
</div>
<div id="outline-container-org750345e" class="outline-3">
<h3 id="org750345e">Ahungry Dot Com&#xa0;&#xa0;&#xa0;<span class="tag"><span class="commonlisp">commonlisp</span></span></h3>
<div class="outline-text-3" id="text-org750345e">
<p>
Site: <a href="http://ahungry.com">http://ahungry.com</a>
</p>

<p>
Source: <a href="https://github.com/ahungry/com.ahungry">https://github.com/ahungry/com.ahungry</a>
</p>

<p>
This site you're reading now.
</p>

<p>
This project was written in Common Lisp circa 2015.  It was originally
written in PHP circa 2010.  The site hosts the "Ahungry EQ Auction
Logger" (<a href="http://ahungry.com/eqauctions">http://ahungry.com/eqauctions</a>).  This is a live-stream of the
Project1999 Classic Everquest Emulator server
(<a href="http://project1999.org">http://project1999.org</a>).  Around 5000 unique players come to the site
daily to watch auctions of their favorite in-game items from out of
game.
</p>

<p>
Originally it was called the auction tracker, but someone emailed
mentioning that that term is actually trademarked and my site was
overshadowing their site (which was for tracking ebay auctions or
something similar).  As such, the page title was renamed.
</p>

<p>
There are a few main parts:
</p>

<ul class="org-ul">
<li>A client binary written in C, bash, common lisp, or clojure, that
uploads/streams logs to a remote listener on the server (used by the
player base).</li>
<li>A listener endpoint that drops the streaming logs in a "bucket" to
be processed by a perl script that converts the logs into database entries.</li>
<li>A database indexer written in common lisp, that works similar to
ElasticSearch for performing fast "natural" word searches.</li>
<li>The front end "client" (the auction page, consisting of
javascript/html, served by a server-side rendered Common Lisp web app).</li>
</ul>

<p>
The project is licensed AGPLv3 or later.
</p>
</div>
</div>
<div id="outline-container-org5ac97d2" class="outline-3">
<h3 id="org5ac97d2">Sluglisp / Slugelisp / Slugclojure&#xa0;&#xa0;&#xa0;<span class="tag"><span class="commonlisp">commonlisp</span></span></h3>
<div class="outline-text-3" id="text-org5ac97d2">
<p>
Sites:
</p>
<ul class="org-ul">
<li><a href="http://sluglisp.ahungry.com">http://sluglisp.ahungry.com</a></li>
<li><a href="http://slugelisp.ahungry.com">http://slugelisp.ahungry.com</a></li>
<li><a href="http://slugclojure.ahungry.com">http://slugclojure.ahungry.com</a></li>
</ul>

<p>
Sources:
</p>
<ul class="org-ul">
<li><a href="https://github.com/ahungry/sluglisp">https://github.com/ahungry/sluglisp</a></li>
<li><a href="https://github.com/ahungry/slugelisp">https://github.com/ahungry/slugelisp</a></li>
<li><a href="https://github.com/ahungry/slugclojure">https://github.com/ahungry/slugclojure</a></li>
</ul>

<p>
These 3 sites are all derivates of each other.  They list packages
available in the Common Lisp (Quicklisp), Emacs Lisp (MELPA), and
Clojure (Clojars) eco-systems.  They extend the native / "official"
channel indexes (similar to javascript NPM / php packagist) by
allowing regex search across the README files of the packages source
code themselves, as well as a front end filter functionality.
</p>

<p>
The underlying system is using the Common Lisp Caveman2 web stack.
</p>

<p>
They work by indexing/pulling down the github star counts and README
files, and essentially grepping them on demand, as a user interacts
with the site(s).
</p>

<p>
The projects are all licensed AGPLv3 or later.
</p>
</div>
</div>
<div id="outline-container-org0e9a355" class="outline-3">
<h3 id="org0e9a355">Langpop&#xa0;&#xa0;&#xa0;<span class="tag"><span class="commonlisp">commonlisp</span></span></h3>
<div class="outline-text-3" id="text-org0e9a355">
<p>
Site: <a href="http://lang-pop.ahungry.com">http://lang-pop.ahungry.com</a>
</p>

<p>
Source: <a href="https://github.com/ahungry/language-popularity">https://github.com/ahungry/language-popularity</a>
</p>

<p>
This site was created for my own usage, to quickly view "popularity"
as derived from Reddit (<a href="https://old.reddit.com">https://old.reddit.com</a>) subscriber counts.
</p>

<p>
The site was created in-tandem with a tutorial on using Common Lisp
web frameworks
(<a href="http://ahungry.com/blog/2015-07-07-Writing-a-Common-Lisp-Web-App.html">http://ahungry.com/blog/2015-07-07-Writing-a-Common-Lisp-Web-App.html</a>).
</p>

<p>
It works by querying data from Reddit's API and making an on-demand
pie chart for a visualization.
</p>

<p>
License: AGPLv3 or later.
</p>
</div>
</div>
</div>
<div id="outline-container-org7380f71" class="outline-2">
<h2 id="org7380f71">Games</h2>
<div class="outline-text-2" id="text-org7380f71">
<p>
In addition to websites, I have tinkered with a variety of games, from
web based games that cover a wide spectrum of implementations
(javascript + canvas, javascript + dom manipulation), to SDL/OpenGL
based native desktop games, to portable framework Godot
(<a href="https://godotengine.org/">https://godotengine.org/</a>) games that run on webgl, android, and native.
</p>
</div>
<div id="outline-container-org0581d6b" class="outline-3">
<h3 id="org0581d6b">Magic Shield Attack&#xa0;&#xa0;&#xa0;<span class="tag"><span class="clojure">clojure</span>&#xa0;<span class="godot">godot</span></span></h3>
<div class="outline-text-3" id="text-org0581d6b">
<p>
Site: <a href="http://magicshieldattack.com">http://magicshieldattack.com</a> (playable at link)
</p>

<p>
Source: <a href="https://github.com/ahungry/magicshieldattack">https://github.com/ahungry/magicshieldattack</a>
</p>

<p>
This one comes first, because it's my biggest focus (and
procrastination).
</p>

<p>
In this game, you move around a grid based world, similar to Final
Fantasy Tactics (play it if you haven't, it's great).  The game plays
like a never-ending roguelike, and as it is written in Godot for the
front end, it's very portable.  Oh - did I mention (as with most my
games) it's multiplayer?  The server side is written in Clojure.
</p>

<p>
I still have a lot of work to do on this game, and my most critical
reviewers for the game are my son and daughter - so, here's to hoping
I finish it before they get too old to be interested in it /laugh.
</p>

<p>
The game is my third big attempt at an online game, and unlike my
first 2 attempts, it tries to remove a lot of the complexity that
creeped in on the gameplay side, by keeping the game extremely basic
at a game play level (think, rock paper scissors, but with movement of
your character playing a role).
</p>

<p>
License: AGPLv3
</p>
</div>
</div>
<div id="outline-container-org6ae1891" class="outline-3">
<h3 id="org6ae1891">Pseudo&#xa0;&#xa0;&#xa0;<span class="tag"><span class="javascript">javascript</span>&#xa0;<span class="commonlisp">commonlisp</span></span></h3>
<div class="outline-text-3" id="text-org6ae1891">
<p>
Site: <a href="http://pseudo.ahungry.com">http://pseudo.ahungry.com</a> (playable at link)
</p>

<p>
Source: <a href="https://github.com/ahungry/pseudo">https://github.com/ahungry/pseudo</a>
</p>

<p>
This game is a "pseudo" 2.5d game - it uses the ray casting technique
to make it appear as if the game is 3d (the old Wolfenstein effect).
</p>

<p>
The game is also multiplayer, but plays in a web browser.  The
"rendering engine" are overlayed slices of DOM controlled via JS, and
the game can run on a 2004 laptop with no lag or staggering.
</p>

<p>
This game was my second big attempt at an online game.  It's very
rogue-lite-esque, as it is essentially never ending, allows collecting
of gear, and has the player dive down into dungeons.
</p>

<p>
The sprites were fun to make on the game - they were done in Aseprite
program.
</p>

<p>
License: AGPLv3
</p>
</div>
</div>
<div id="outline-container-orgae7bcb6" class="outline-3">
<h3 id="orgae7bcb6">Ahungry Tactics&#xa0;&#xa0;&#xa0;<span class="tag"><span class="javascript">javascript</span></span></h3>
<div class="outline-text-3" id="text-orgae7bcb6">
<p>
Site: <a href="http://tactics.ahungry.com">http://tactics.ahungry.com</a>
</p>

<p>
Source: <a href="https://github.com/ahungry/ahungry-tactics">https://github.com/ahungry/ahungry-tactics</a>
</p>

<p>
Very original name right?  This is a Final Fantasy Tactics like game,
where you move around on a grid system.  It uses websockets just like
the Pseudo game to handle multiplayer.  It also sprinkles in some
elements of the digital card game genre, so players collect cards to
do their attacks (and can trade cards).
</p>

<p>
The game was originally written using JS AJAX polling with a PHP
backend / daemon that would update the game loop every 10 or so
seconds. Over time, it was rewritten into Common Lisp like a lot of my
other early PHP projects.
</p>

<p>
License: APGLv3
</p>
</div>
</div>
</div>
<div id="outline-container-org156749d" class="outline-2">
<h2 id="org156749d">Emacs Lisp Packages&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></h2>
<div class="outline-text-2" id="text-org156749d">
<p>
I enjoy using Emacs, and I also enjoy extending it (and sharing the
extensions with the world).
</p>

<p>
If you load up the package list in Emacs (M-x list-packages) and press
'f' for filter, and type 'ahungry', you should, at a minimum, see:
</p>

<div class="org-src-container">
<pre class="src src-sh">geben-helm-proj... 20160611.59   available  melpa      Integrate helm-projectile with geben
prog-fill          20180607.132  available  melpa      Smartly format lines to use vertical space.
swagger-to-org     20160611.56   available  melpa      Convert a swagger.json file into an org-mode file
ahungry-theme      20180131.328  installed             Ahungry color theme for Emacs.  Make sure to <span style="color: #cf0; font-weight: bold; font-style: italic;">(</span>load-theme <span style="color: #0a3;">'ahungry).</span>
<span style="color: #0a3;">md4rd              20190313.240  installed             Mode for reddit (browse it).</span>
<span style="color: #0a3;">org-jira           20190712.443  installed             Syncing between Jira and Org-mode.</span>
</pre>
</div>

<p>
Those are packages I have added to GNU Elpa or MELPA at some point.
</p>

<p>
I have a few more that I've added to Github, that I should still
submit to one or the other (but occasionally the MELPA review process
is a blocking point for getting the code accepted).
</p>
</div>

<div id="outline-container-org847673c" class="outline-3">
<h3 id="org847673c">Color Theme Ahungry&#xa0;&#xa0;&#xa0;<span class="tag"><span class="themes">themes</span>&#xa0;<span class="elisp">elisp</span></span></h3>
<div class="outline-text-3" id="text-org847673c">
<p>
Source: <a href="https://github.com/ahungry/color-theme-ahungry">https://github.com/ahungry/color-theme-ahungry</a>
</p>

<p>
install from GELPA/MELPA: M-x package-install RET ahungry-theme
</p>

<p>
For this package, I went through the copyright assignment papers and
gave the full copyright to the Free Software Foundation (<a href="https://www.fsf.org/">https://www.fsf.org/</a>).
</p>

<p>
Essentially its just a color theme for Emacs, but it was my first
foray into an "official" Emacs contribution and GNU project.  The
experience for contribution was very different than that of
contributing to a Github issue, but the community/mailing list was
extremely welcoming and encouraging.
</p>

<p>
The package is available in GNU Elpa and MELPA package repositories.
</p>

<p>
I have a branch with a "mello-theme" that I use day to day, that I
<b>greatly</b> prefer compared to my original "master" branch theme that I
had added to the GNU Elpa repository.  I should make that an official
installable package.
</p>

<p>
License: GPLv3
</p>
</div>
</div>
<div id="outline-container-org668403c" class="outline-3">
<h3 id="org668403c">Org Jira&#xa0;&#xa0;&#xa0;<span class="tag"><span class="jira">jira</span>&#xa0;<span class="elisp">elisp</span></span></h3>
<div class="outline-text-3" id="text-org668403c">
<p>
Source: <a href="https://github.com/ahungry/org-jira">https://github.com/ahungry/org-jira</a>
</p>

<p>
install from MELPA: M-x package-install RET org-jira
</p>

<p>
This is a package that I took over when the old maintainer (Baohajun)
went inactive due to no longer using Jira.
</p>

<p>
It's probably my most starred github repository.
</p>

<p>
It allows integration between Emacs' org-mode and the Jira ticket
system by Atlassian.
</p>

<p>
My first large contribution (that gained confidence to hand the
package over to me) was a nearly full rewrite of the networking code,
to take it from a synchronous/blocking package (aka, it would lock up
Emacs entirely while pulling down Jira issues, much like GNUS in Emacs
does) to a fully async/callback based variant (so, hundreds of issues
can get pulled down without any interruption to the user of Emacs).
</p>

<p>
I continue to maintain the package and try to be altruistic in serving
the community with feature requests that I do not necessarily have a
use for.
</p>

<p>
License: GPLv3
</p>
</div>
</div>
<div id="outline-container-orga8f69c1" class="outline-3">
<h3 id="orga8f69c1">md4rd (mode for reddit, aka reddit-mode)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="elisp">elisp</span>&#xa0;<span class="reddit">reddit</span></span></h3>
<div class="outline-text-3" id="text-orga8f69c1">
<p>
Source: <a href="https://github.com/ahungry/md4rd">https://github.com/ahungry/md4rd</a>
</p>

<p>
install from MELPA: M-x package-install RET md4rd
</p>

<p>
This package is one I invented that went beyond a maintenance
inheritance, or a color theme.  It was not necessarily the first, but
it is definitely the most popular.
</p>

<p>
It allows reading Reddit while in Emacs.  I got the idea while using
the Emacs hacker news mode, and coming across a "hierarchy" Emacs
package (essentially tree-like folding of any arbitrary data structures).
</p>

<p>
It allows Oauth level sign in, which will permit the user to
upvote/downvote/post comments on a main subject, or on another user's
comments.
</p>
</div>
</div>
</div>


<div id="outline-container-org5d48720" class="outline-2">
<h2 id="org5d48720">Conclusion</h2>
<div class="outline-text-2" id="text-org5d48720">
<p>
If you think anything here looks particularly interesting, or just
want to chat / mention / request something of me, feel free to drop me
a line at m@ahungry.com, or ping me on twitter at
<a href="https://twitter.com/_ahungry">https://twitter.com/_ahungry</a>, or leave a comment below.
</p>
</div>
</div>

<div id="outline-container-org3fd9751" class="outline-2">
<h2 id="org3fd9751">Comments</h2>
<div class="outline-text-2" id="text-org3fd9751">
<div id="disqus_thread"></div>
<script type="text/javascript">
    /* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
    var disqus_shortname = 'ahungry'; // required: replace example with your forum shortname

    /* * * DON'T EDIT BELOW THIS LINE * * */
    (function() {
        var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
        dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    })();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

<link href="projects.css" rel="stylesheet" type="text/css" />
<script src="projects.js"></script>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matthew Carter</p>
<p class="date">Created: 2019-09-19 Thu 01:02</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
